In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("salaries_by_college_major.csv")

In [4]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [6]:
df = df.dropna(how = "any")

In [9]:
df['Starting Median Salary'].max()

74300.0

In [14]:
df['Undergraduate Major'].loc[df['Starting Median Salary'].idxmax()]

'Physician Assistant'

In [15]:
df.loc[df['Starting Median Salary'].idxmax()]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

In [19]:
df['Mid-Career Median Salary'].max()

107000.0

In [16]:
df['Undergraduate Major'].loc[df['Mid-Career Median Salary'].idxmax()]

'Chemical Engineering'

In [21]:
df['Undergraduate Major'].loc[df['Starting Median Salary'].idxmin()]

'Spanish'

In [22]:
df['Starting Median Salary'].min()

34000.0

In [24]:
df['Undergraduate Major'].loc[df['Mid-Career Median Salary'].idxmin()]

'Education'

In [25]:
df['Mid-Career Median Salary'].min()

52000.0

In [3]:
df.insert(4 , "Average Income" , df['Mid-Career 90th Percentile Salary'] - df['Mid-Career 10th Percentile Salary'])

In [4]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Average Income,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,109800.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,96700.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,113700.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,104200.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,85400.0,136000.0,Business

In [16]:
df_sorted = df.sort_values("Average Income" , ascending = False)

In [18]:
df_sorted[['Undergraduate Major' ,'Average Income']].head(5)

   Undergraduate Major  Average Income
17           Economics        159400.0
22             Finance        147800.0
37                Math        137800.0
36           Marketing        132900.0
42          Philosophy        132500.0

In [19]:
df2 = df.sort_values("Mid-Career 90th Percentile Salary" , ascending = False)

In [20]:
df2[['Undergraduate Major' , 'Mid-Career 90th Percentile Salary']].head(5)

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

In [24]:
df.groupby("Group").mean()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Average Income,Mid-Career 90th Percentile Salary
Group,,,,,
Business,44633.333333,75083.333333,43566.666667,103958.333333,147525.000000
HASS,37186.363636,62968.181818,34145.454545,95218.181818,129363.636364
STEM,53862.500000,90812.500000,56025.000000,101600.000000,157625.000000